; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v5 - type_3 ?v7 - type_1)
 	      (pred_4 ?v1 - object ?v7 - type_1)
	      (pred_2 ?v5 - type_3 ?v4 - type_2)
	      (pred_3 ?v5 - type_3 ?v1 - object ?v4 - type_2))

   (:action op_3
       :parameters  (?v5 - type_3 ?v8 ?v2 - type_1)
       :precondition (and  (pred_1 ?v5 ?v8))
       :effect (and  (pred_1 ?v5 ?v2)
		     (not (pred_1 ?v5 ?v8))))

   (:action op_1
       :parameters (?v5 - type_3 ?v3 - object ?v6 - type_1 ?v4 - type_2)
       :precondition  (and  (pred_4 ?v3 ?v6) (pred_1 ?v5 ?v6) (pred_2 ?v5 ?v4))
       :effect (and (pred_3 ?v5 ?v3 ?v4)
		    (not (pred_4 ?v3 ?v6)) 
		    (not (pred_2 ?v5 ?v4))))

   (:action op_2
       :parameters (?v5 - type_3 ?v3 - object ?v6 - type_1 ?v4 - type_2)
       :precondition  (and  (pred_3 ?v5 ?v3 ?v4) (pred_1 ?v5 ?v6))
       :effect (and (pred_4 ?v3 ?v6)
		    (pred_2 ?v5 ?v4)
		    (not (pred_3 ?v5 ?v3 ?v4)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_12 obj_07 - type_3
obj_13 obj_06 obj_04 obj_08 - type_2
obj_09 obj_03 obj_05 obj_02 - type_1
obj_01 obj_10 obj_11 - object)
(:init
(pred_1 obj_12 obj_03)
(pred_2 obj_12 obj_13)
(pred_2 obj_12 obj_06)
(pred_1 obj_07 obj_03)
(pred_2 obj_07 obj_04)
(pred_2 obj_07 obj_08)
(pred_4 obj_01 obj_09)
(pred_4 obj_10 obj_09)
(pred_4 obj_11 obj_03)
)
(:goal
(and
(pred_4 obj_01 obj_05)
(pred_4 obj_10 obj_09)
(pred_4 obj_11 obj_09)
)
)

(:constraints
  (always (not (pred_1 obj_12 obj_05)))
)
)

; plan
1. (op_1 obj_12 obj_11 obj_03 obj_06)
   deleted: (pred_4 obj_11 obj_03) (pred_2 obj_12 obj_06)
   added: (pred_3 obj_12 obj_11 obj_06)
   goals met: 1 of 3
2. (op_3 obj_07 obj_03 obj_09)
   deleted: (pred_1 obj_07 obj_03)
   added: (pred_1 obj_07 obj_09)
   goals met: 1 of 3
3. (op_3 obj_12 obj_03 obj_09)
   deleted: (pred_1 obj_12 obj_03)
   added: (pred_1 obj_12 obj_09)
   goals met: 1 of 3
4. (op_1 obj_12 obj_01 obj_09 obj_13)
   deleted: (pred_4 obj_01 obj_09) (pred_2 obj_12 obj_13)
   added: (pred_3 obj_12 obj_01 obj_13)
   goals met: 1 of 3
5. (op_2 obj_12 obj_11 obj_09 obj_06)
   deleted: (pred_3 obj_12 obj_11 obj_06)
   added: (pred_4 obj_11 obj_09) (pred_2 obj_12 obj_06)
   goals met: 2 of 3
6. (op_2 obj_12 obj_01 obj_09 obj_13)
   deleted: (pred_3 obj_12 obj_01 obj_13)
   added: (pred_4 obj_01 obj_09) (pred_2 obj_12 obj_13)
   goals met: 2 of 3
7. (op_1 obj_07 obj_01 obj_09 obj_08)
   deleted: (pred_4 obj_01 obj_09) (pred_2 obj_07 obj_08)
   added: (pred_3 obj_07 obj_01 obj_08)
   goals met: 2 of 3
8. (op_3 obj_07 obj_09 obj_05)
   deleted: (pred_1 obj_07 obj_09)
   added: (pred_1 obj_07 obj_05)
   goals met: 2 of 3
9. (op_2 obj_07 obj_01 obj_05 obj_08)
   deleted: (pred_3 obj_07 obj_01 obj_08)
   added: (pred_4 obj_01 obj_05) (pred_2 obj_07 obj_08)
   goals met: 3 of 3
